docs/vkr.tex
% Created 2023-01-23 Пн 22:18
% Intended LaTeX compiler: pdflatex
\documentclass[PI, VKR]{HSEUniversity}
         \usepackage{array,tabularx,tabulary,booktabs,longtable,multirow}
         \Year{\the\year{}}
         \supervisor{к.т.н., доцент кафедры информационных технологий в бизнесе НИУ ВШЭ-Пермь}{А. В. Бузмаков}
                  \Abstract{В данной работе проведен анализ этичности разных компаний.

В первой главе находится описание используемых алгоримов.

Во второй главе представлено проектирование системы.

В третьей главе представлена реализация системы.

В четвертой главе представлено тестирование работы системы.

Количество страниц - N, количество иллюстраций - N, количетсво таблиц - N.}


\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Соломатин Роман Игоревич}
\date{\today}
\title{Разработка сайта для автоматического сбора, анализа и визуализации информации по этичности компаний}
\hypersetup{
 pdfauthor={Соломатин Роман Игоревич},
 pdftitle={Разработка сайта для автоматического сбора, анализа и визуализации информации по этичности компаний},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.6)},
 pdflang={Ru}}
\usepackage{biblatex}
\addbibresource{/home/samoed/Desktop/ESGanalysis/docs/library.bib}
\begin{document}

\maketitle

\chapter*{Введение}
\label{sec:orgc9feaaf}
Этичность компаний уже давно вызывает озабоченность, особенно в отношении их поведения в спорных ситуациях и предоставления услуг, ориентированных на клиента. В последние годы все большее внимание уделяется оценке этичности компаний\autocite{mure_esg_2021}, особенно в банковском секторе и через призму экологических, социальных и управленческих факторов (ESG). Необходимость в таких оценках становится все более острой по мере того, как общество продолжает бороться с последствиями неправомерных действий корпораций и более широким воздействием корпоративной деятельности на общество и окружающую среду.

В настоящее время существует несколько сервисов, которые призваны оценивать этику компании, но эти оценки часто основаны на судебных делах и других официальных отчетах, а не на отзывах клиентов. Это привело к ситуации, когда отдельные лица должны проводить свои собственные исследования, чтобы определить насколько этична компания. Это часто включает в себя просмотр отзывов с различных веб-сайтов, что может занять много времени и не всегда может дать исчерпывающую или точную картину.

Для решения этой проблемы будет реализована система, которая собирала бы и анализировала отзывы потребителей с различных веб-сайтов, чтобы дать более полную и точную оценку этической практики компании. Такая система может быть разработана для автоматического сбора и анализа отзывов потребителей из различных источников, включая социальные сети и сайты отзывов. Затем собранные данные могут быть проанализированы с помощью различных методов, таких как обработка естественного языка и машинное обучение, для выявления закономерностей и тенденций, связанных с этической практикой компании. Полученный анализ может быть использован для разработки более надежной и достоверной системы оценки этичности компаний.

Объект исследования – деятельность компаний.

Предмет исследования – программные средства для оценки этичности деятельности компаний.

Цель работы – создание системы для оценки этичности компаний.

Исходя из поставленной цели, необходимо:

\begin{enumerate}
\item Провести анализ предметной области
\item Провести анализ системы
\item Реализовать систему
\item Провести тестирование системы
\end{enumerate}

Этап анализа должен:
\begin{enumerate}
\item Анализ предметной области
\item Анализ существующих алгоритмов
\end{enumerate}

Этап проектирования должен включать:
\begin{enumerate}
\item Проектирование серверной части
\item Проектирование модели для определения этичности
\item Проектирование клиентской части приложения
\end{enumerate}

Этап реализации должен включать:
\begin{enumerate}
\item Описание сбора данных
\item Реализации модели
\item Реализации серверной части
\item Реализации клиентской части
\end{enumerate}

Этап тестирования должен включать:
\begin{enumerate}
\item Тестирование модели
\item Тестирование серверной части
\item Тестирование клиентской части
\end{enumerate}
\chapter{Анализ предметной области}
\label{sec:org6845ba1}
\section{Способы оценки этичности компаний}
\label{sec:org6d93754}
Компаниям важно оставаться этичными, так как на долгосрочной перспективе это приносит большую прибыль и улучшает показатели бизнеса, чем неэтичный способ ведение бизнеса\autocites{climent_ethical_2018}[][]{mure_esg_2021}. На сколько этична компания можно с двух сторон, самой компании и их клиентов. Со стороны компаний можно выделить факторы, которые можно получить из их отчетности:
\begin{itemize}
\item Количество капитала, чтобы они не могли обанкротиться
\item какое влияние они вносят на окружающую среду
\item куда идут инвестиции\autocite{harvey1995ethical}
\end{itemize}

Для пользователей одним из ключевых факторов можно выделить:
\begin{itemize}
\item качество пользовательского сервиса\autocite{brunk2010exploring}
\item на сколько навязчивые услуги компании\autocite{mitchell1992bank}
\end{itemize}

Кроме того, важно отметить, что оценка этики компании - это не одноразовый процесс, а скорее непрерывная попытка понять и оценить действия, политику и практику компании с течением времени. Это включает в себя рассмотрение соблюдения компанией отраслевых этических стандартов и передовой практики, а также мониторинг любых изменений в этической позиции компании с течением времени. Кроме того, участие в диалоге с компанией и консультации с организациями, специализирующимися на оценке корпоративной ответственности, могут дать ценную информацию об этических практиках компании.

В этой работе для анализа текстов будут использоваться алгоритмы машинного обучения.
\section{Алгоритмы для анализа текста}
\label{sec:org69c83f5}
Алгоритмы машинного обучения для анализа текста получили широкое распространение для извлечения информации из неструктурированных данных с помощью больших помеченных наборов данных. Среди различных используемых методов несколько алгоритмов оказались особенно эффективными в этой области. К ним относятся мешок слов\autocite{doi:10.1080/00437956.1954.11659520}, TF-IDF\autocite{jones1972statistical}, Word2Vec\autocite{mikolov2013distributed}, ELMO\autocite{elmo}, GPT\autocite{radford2019language} и BERT\autocite{devlin2018bert}. Каждый из этих алгоритмов обладает уникальными характеристиками, которые делают их хорошо подходящими для определенных приложений.

Модель "Мешок слов" представляет текстовые данные путем присвоения уникального номера каждому слову в документе. Этот метод прост в своей реализации, но не учитывает порядок слов в предложении. Модель TF-IDF, с другой стороны, представляет текстовые данные, учитывая как частоту слова в документе (TF), так и его важность в общем наборе данных (IDF). Это простые методы анализа текста и не учитывают контекст текста.

Word2Vec, ELMO, GPT и BERT - все это алгоритмы на основе нейронных сетей, которые представляют текстовые данные более сложным способом. Word2Vec представляет слова в виде векторов и может фиксировать значение слов в аналогичных контекстах. ELMO, GPT и BERT основаны на архитектуре transformer, где каждое предложение представлено вектором цифр (эмбеддингом). BERT -- лучше остальных алгоритмов понимает текст, так как он может рассматривать слова в контексте всего предложения или текста, когда GPT и ELMO рассматривают только односторонний контекст.

Также для объединения эмбеддинговых пространств будет работать алгоритм подобный CLIP\autocite{radford2021learning}, только для трансформации текста в текст.
\section{Методы}
\label{sec:org1b7a051}
\chapter{Проектирование системы}
\label{sec:org2a12c33}
\section{Проектирование базы данных}
\label{sec:org194e08b}

\section{Проектирование архитектуры системы}
\label{sec:orgf6ba02b}
\subsection{Проектирование серверной части}
\label{sec:org1f66248}
\subsection{Проектирование клиентской части}
\label{sec:org3076ae3}

\chapter{Реализация системы}
\label{sec:org6eb8684}
\section{Реализация серверной части}
\label{sec:org63955d5}
\subsection{Реализация API}
\label{sec:orgf53feda}
\subsection{Реализация парсера banki.ru}
\label{sec:org7e5099b}
\subsection{Реализация парсера sravni.ru}
\label{sec:org237fe7d}
\subsection{Реализация модуля обработки текста}
\label{sec:org3b6eeca}
\section{Реализация клиентской части}
\label{sec:orgd20bd1e}
\chapter{Тестирование системы}
\label{sec:org33a6c6c}
\chapter*{Заключение}
\label{sec:orgb140b13}
%\nocite{*}
\putbibliography
\appendix
\end{document}
